# CandelasPerSquareFoot Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..CandelasPerSquareFoot Property
UnitTypeId Class See Also
---
Candelas per square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CandelasPerSquareFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CandelasPerSquareFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CandelasPerSquareFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace